The  FabricationPartRouteEnd  type exposes the following members.
 Methods
Name  |   Description
CreateFromCenterline
 Create fabrication routing end from centreline point on straight element.
CreateFromConnector
 Create fabrication routing end from connector end point.
Dispose
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 See Also
  FabricationPartRouteEnd Class
  Autodesk.Revit.DB.Fabrication Namespace